#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-w3K6TMdDrCB43CGT

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.tara: Refreshing state... [id=38240725]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_role.ec2_primary: Refreshing state... [id=ec2-primary]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_instance_profile.ec2_primary: Refreshing state... [id=ec2-profile]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_security_group.http: Refreshing state... [id=sg-065a412fecefab781]
aws_security_group.https: Refreshing state... [id=sg-0a3410176c57a9dcb]
aws_security_group.ssh: Refreshing state... [id=sg-07a113216ea602a4f]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
aws_iam_policy.ec2_primary: Refreshing state... [id=arn:aws:iam::558855412466:policy/ec2-primary-policy]
aws_security_group_rule.allow_outbound_http_return: Refreshing state... [id=sgrule-4180701166]
aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3902821458]
aws_security_group_rule.allow_ephemeral_ssh_return: Refreshing state... [id=sgrule-139332016]
aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1461435279]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
aws_security_group_rule.allow_outbound_https_return: Refreshing state... [id=sgrule-691814140]
aws_instance.primary: Refreshing state... [id=i-0af15aa08dc6a2943]
aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3725321253]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_role_policy_attachment.ec2_primary: Refreshing state... [id=ec2-primary-20230806154009241400000001]
aws_eip.primary: Refreshing state... [id=eipalloc-0df438faa35a069af]
module.remote_state.aws_s3_bucket.this: Drift detected (update)
aws_iam_instance_profile.ec2_primary: Drift detected (update)
aws_security_group_rule.allow_outbound_http_return: Drift detected (update)
aws_iam_user_login_profile.personal: Drift detected (update)
aws_iam_policy.iac_deployer: Drift detected (update)
aws_iam_policy.ec2_primary: Drift detected (update)
aws_key_pair.main: Drift detected (update)
aws_security_group_rule.allow_inbound_ssh: Drift detected (update)
aws_security_group_rule.allow_outbound_https: Drift detected (update)
aws_security_group_rule.allow_outbound_http: Drift detected (update)
aws_route_table.gateway: Drift detected (update)
aws_security_group_rule.allow_outbound_https_return: Drift detected (update)
aws_security_group_rule.allow_ephemeral_ssh_return: Drift detected (update)
aws_subnet.main: Drift detected (update)
aws_instance.primary: Drift detected (update)
aws_vpc.main: Drift detected (update)
module.configuration_bucket.aws_s3_bucket.this: Drift detected (update)
module.postgres_backups.aws_s3_bucket.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.primary will be updated in-place
  ~ resource "aws_eip" "primary" {
        id                   = "eipalloc-0df438faa35a069af"
      ~ instance             = "i-0af15aa08dc6a2943" -> (known after apply)
        tags                 = {}
        # (12 unchanged attributes hidden)
    }

  # aws_instance.primary must be replaced
-/+ resource "aws_instance" "primary" {
      ~ arn                                  = "arn:aws:ec2:eu-west-1:558855412466:instance/i-0af15aa08dc6a2943" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0af15aa08dc6a2943" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0af8d411d0d5e4716" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-53.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.53" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "52.48.168.54" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          + "sg-065a412fecefab781",
          + "sg-07a113216ea602a4f",
          + "sg-0a3410176c57a9dcb",
        ]
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      ~ vpc_security_group_ids               = [
          - "sg-065a412fecefab781",
          - "sg-07a113216ea602a4f",
          - "sg-0a3410176c57a9dcb",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-076e9ee44676947ab" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>